Revit 2024 API
RebarShapeConstraint Class
 A dimension or other constraint that takes part in a RebarShapeDefinition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class RebarShapeConstraint : IDisposable
Visual Basic
Public Class RebarShapeConstraint _
	Implements IDisposable
Visual C++
public ref class RebarShapeConstraint : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
 Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
 Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
 Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
 Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
 Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
See Also
RebarShapeConstraint Members
Autodesk.Revit.DB.Structure Namespace